# 1 Найти в текущем каталоге и всех его подкаталогах только обычные файлы
find . -type f

# 2 Найти все файлы с расширением .log в текущем каталоге и подкаталогах
find . -type f -name "*.log"

# 3 Найти .log-файлы независимо от регистра .log, .LOG, .Log
find . -type f -iname "*.log"

# 4 Найти обычные файлы размером больше 10 мб
find . -type d -size +10M

# 5 Найти .log-файлы, которые изменялись за последние 7 дней
find . -type f -name "*.log" -mtime -7

# 6 Найти обычные файлы с расширением .csv или .json
# палки - объединение условий (ищи и то, и то)
find . -type f \( -name "*.csv" -o -name "*.json" \)

# 7 Найти все .log-файлы, кроме файлов, имя которых начинается с debug
# тут отрицание второго условия 
find . -type f -name "*.log" ! -name "debug*"

# 8 Найти .log-файлы больше 5 мб, измененные за последние 3 дня 
find . -type f -name "*.log" -size +5M -mtime -3

# 9 Найти .tmp-файлы старше 30 дней и удалить их
find . -type f -name "*.tmp" -mtime +30 -delete # +30 или -30????

# 10 Найти .log-файлы больше 10 МБ и вывести размер и путь кждого файла 
find . -type f -name "*.log" -size +10M -exec du -h {} +

