# 1 Сортировать строки файла users.txt по алфавиту 
sort userts.txt

# 2 Отсортировать строки файла в обратном порядке
sort -r users.txt

# 3 В файле numbers.txt находятся числа. Отсортировать их по числовому значению
sort -n users.txt

# 4 Отсортировать числа от большего к меньшему
sort -nr users.txt

# 5 Отсортировать users.txt и оставить только уникальные строки
sort -u users.txt

# 6 В employees.txt поля разделены пробелами: name department salary. отсортировать сотрудников по зп
sort -k3,3n employees.txt

# 7 В employees.csv поля разделены ,. Отсортировать записи по 3 столбцу как числа
sort -t',' -k3,3n employees.txt

# 8 В files.txt находятся значения 10к, 25м, 2g, 500k, отсортировать их по реальному размеру
sort -h files.txt

# 9 Из app.log взять только строки с ERROR, извлечь тип ошибки, посчитать количество каждого типа и отсортировать по частоте

# 10 Из access.log получить ip-адреса, посчитать количество запросов каждого ip и вывести 5 наиболее активных