# 1 В файле users.txt удалить повторяющиеся соседние строки 
uniq users.txt

# 2 Получить список уникальных пользователей, даже если одинаковые строки в разных местах файла
sort users.txt | uniq

# 3 Показать каждое уникальное имя пользователя и количество его появлений
sort users.txt | uniq -c

# 4 Вывести только пользователей, которые встречаются больше 1 раза
sort users.txt | uniq -d

# 5 Вывести пользователей, которые встречаются в файле только 1 раз
sort users.txt | uniq -u

# 6 Считать ivan, IVAN и Ivan одинаковыми значениями
sort -f users.txt | uniq -l

# 7 Посчитать повторения и вывести значения от самых частых к самым редким
sort users.txt | uniq -c | sort -nr

# 8 Найти 5 пользователей, которые встречаются в файле чаще всего
sort users.txt | uniq -c | sort -nr | head(5)

# 9 Из access.log извлечь IP-адреса, определить уникальные и посчитать кол-во обращений каждого IP

# 10 В access.log взять только строки с ERROR, извлечь IP, посчитать обращения и вывести топ-5 IP


